Hi. I am experiencing the same issue. Here're more details to reproduce. In a nutshell I want to explicitly disable data cache, but after successful creation all the following terraform plans contain a diff even though data cache is disabled on the CloudSQL instance.

# Config
```tf
terraform {
  required_version = "= 1.5.5"

  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "6.12.0"
    }
  }
}

variable "region" {
  default = "europe-west1"
}

variable "team_project" {
  default = "some"
}

provider "google" {
  project = var.team_project
  region  = var.region
}

resource "google_sql_database_instance" "test-provider-data-cache-bug" {
  name             = "test-provider-data-cache-bug"
  project          = var.team_project
  region           = var.region
  database_version = "POSTGRES_16"

  settings {
    tier      = "db-perf-optimized-N-2"
    edition   = "ENTERPRISE_PLUS"

    data_cache_config {
      data_cache_enabled = false
    }
  }

  deletion_protection = false
}
```

# Steps to reproduce

1. Create database instance with data cache disabled via terraform
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database_instance.test-provider-data-cache-bug will be created
  + resource "google_sql_database_instance" "test-provider-data-cache-bug" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_16"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "test-provider-data-cache-bug"
      + private_ip_address             = (known after apply)
      + project                        = "some"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "europe-west1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "SOME_SSD"
          + edition               = "ENTERPRISE_PLUS"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-perf-optimized-N-2"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + data_cache_config {
              + data_cache_enabled = false
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
2. Run terraform plan again on the same tf file
```
google_sql_database_instance.test-provider-data-cache-bug: Refreshing state... [id=test-provider-data-cache-bug]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_sql_database_instance.test-provider-data-cache-bug will be updated in-place
  ~ resource "google_sql_database_instance" "test-provider-data-cache-bug" {
        id                             = "test-provider-data-cache-bug"
        name                           = "test-provider-data-cache-bug"
        # (15 unchanged attributes hidden)

      ~ settings {
            # (15 unchanged attributes hidden)

          + data_cache_config {
              + data_cache_enabled = false
            }

            # (3 unchanged blocks hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

# Terraform state

I checked the tf state and it has `"data_cache_config": []` instead of explicit `false` which I believe is the reason for phantom diffs. Even If I apply this change, state is not modified and next terraform plan shows diff again.

Here's the full tf state.

```json
{
  "mode": "managed",
  "type": "google_sql_database_instance",
  "name": "test-provider-data-cache-bug",
  "provider": "provider[\"registry.terraform.io/hashicorp/google\"]",
  "instances": [
    {
      "schema_version": 0,
      "attributes": {
        "available_maintenance_versions": [],
        "clone": [],
        "connection_name": "some:europe-west1:test-provider-data-cache-bug",
        "database_version": "POSTGRES_16",
        "deletion_protection": false,
        "dns_name": "",
        "encryption_key_name": null,
        "first_ip_address": "<sensitive>",
        "id": "test-provider-data-cache-bug",
        "instance_type": "CLOUD_SQL_INSTANCE",
        "ip_address": [
          {
            "ip_address": "<sensitive>",
            "time_to_retire": "",
            "type": "PRIMARY"
          },
          {
            "ip_address": "<sensitive>",
            "time_to_retire": "",
            "type": "OUTGOING"
          }
        ],
        "maintenance_version": "POSTGRES_16_4.R20240910.01_17",
        "master_instance_name": "",
        "name": "test-provider-data-cache-bug",
        "private_ip_address": "",
        "project": "some",
        "psc_service_attachment_link": "",
        "public_ip_address": "<sensitive>",
        "region": "europe-west1",
        "replica_configuration": [],
        "replica_names": [],
        "restore_backup_context": [],
        "root_password": null,
        "self_link": "https://sqladmin.googleapis.com/sql/v1beta4/projects/some/instances/test-provider-data-cache-bug",
        "server_ca_cert": [
          {
            "cert": "<sensitive>",
            "common_name": "<sensitive>",
            "create_time": "2024-11-28T15:28:10.758Z",
            "expiration_time": "2034-11-26T15:29:10.758Z",
            "sha1_fingerprint": "<sensitive>"
          }
        ],
        "service_account_email_address": "<sensitive>@gcp-sa-cloud-sql.iam.gserviceaccount.com",
        "settings": [
          {
            "activation_policy": "ALWAYS",
            "active_directory_config": [],
            "advanced_machine_features": [],
            "availability_type": "ZONAL",
            "backup_configuration": [
              {
                "backup_retention_settings": [
                  {
                    "retained_backups": 15,
                    "retention_unit": "COUNT"
                  }
                ],
                "binary_log_enabled": false,
                "enabled": true,
                "location": "",
                "point_in_time_recovery_enabled": true,
                "start_time": "15:00",
                "transaction_log_retention_days": 14
              }
            ],
            "collation": "",
            "connector_enforcement": "NOT_REQUIRED",
            "data_cache_config": [],
            "database_flags": [],
            "deletion_protection_enabled": false,
            "deny_maintenance_period": [],
            "disk_autoresize": true,
            "disk_autoresize_limit": 0,
            "disk_size": 10,
            "disk_type": "SOME_SSD",
            "edition": "ENTERPRISE_PLUS",
            "enable_dataplex_integration": false,
            "enable_google_ml_integration": false,
            "insights_config": [],
            "ip_configuration": [
              {
                "allocated_ip_range": "",
                "authorized_networks": [],
                "enable_private_path_for_google_cloud_services": false,
                "ipv4_enabled": true,
                "private_network": "",
                "psc_config": [],
                "server_ca_mode": "GOOGLE_MANAGED_INTERNAL_CA",
                "ssl_mode": "ALLOW_UNENCRYPTED_AND_ENCRYPTED"
              }
            ],
            "location_preference": [
              {
                "follow_gae_application": "",
                "secondary_zone": "",
                "zone": "europe-west1-b"
              }
            ],
            "maintenance_window": [],
            "password_validation_policy": [],
            "pricing_plan": "PER_USE",
            "sql_server_audit_config": [],
            "tier": "db-perf-optimized-N-2",
            "time_zone": "",
            "user_labels": {},
            "version": 1
          }
        ],
        "timeouts": null
      },
      "sensitive_attributes": [],
      "private": "<sensitive>"
    }
  ]
}
```